function getPersianHolidays() {
    const persianHolidays = [[],[],[],[],[],[],[],[],[],[],[],[],[]];
    persianHolidays[1][1] = ['آغاز نوروز'];
    persianHolidays[1][2] = ['عید ایّام'];
    persianHolidays[1][3] = ['عید ایّام'];
    persianHolidays[1][4] = ['عید ایّام'];
    persianHolidays[1][12] = ['روز جمهوری اسلامی ایران'];
    persianHolidays[1][13] = ['روز طبیعت'];
    persianHolidays[3][14] = ['رحلت حضرت امام خمینی (ره) رهبر کبیر انقلاب و بنیانگذار جمهوری اسلامی ایران (1368هـ ش)', 'انتخاب حضرت آیت الله خامنه‌ای به رهبری(1368 هـ ش)'];
    persianHolidays[3][15] = 'قیام خونین 15 خرداد (1342 هـ ش)';
    persianHolidays[11][22] = 'پیروزی انقلاب اسلامی ایران و سقوط نظام شاهنشاهی (1357 هـ ش)';
    persianHolidays[12][29] = 'روز ملی شدن صنعت نفت ایران (1329 هـ ش)';
    persianHolidays[12][30] = 'آخرین روز سال';

    return persianHolidays;
}

function getLunarHolidays() {
    const lunarHolidays = [[],[],[],[],[],[],[],[],[],[],[],[],[]];
    lunarHolidays[1][9] = ['تاسوعای حسینی']; 
    lunarHolidays[1][10] = ['عاشورای حسینی'];
    lunarHolidays[2][20] = ['اربعین حسینی'];
    lunarHolidays[2][28] = [
        'رحلت حضرت رسول اکرم صلی الله علیه و آله ( 11 هـ ق )',
        'شهادت حضرت امام حسن مجتبی علیه السلام ( 50 هـ ق)'
    ];
    lunarHolidays[2][29] = ['شهادت حضرت امام رضا علیه‌السلام'];
    lunarHolidays[3][8] = [
        'شهادت حضرت امام حسن عسگری (ع) (260 هـ.ق)',
        'آغاز ولایت حضرت ولی‌عصر(عج)'
    ];
    lunarHolidays[3][17] = [
        'میلاد حضرت رسول اکرم صلی الله علیه و آله (53 سال قبل از هجرت )', 
        'میلاد حضرت امام جعفر صادق علیه‌السلام مؤسس مذهب جعفری (83 هـ ق)'
    ];
    lunarHolidays[6][3] = ['شهادت حضرت فاطمه‌ی زهرا سلام‌اللّه علیها (۱۱ ه‍.ق)'];
    lunarHolidays[7][13] = ['ولادت حضرت امام علی علیه‌السلام (۲۳ سال قبل از هجرت)'];
    lunarHolidays[7][27] = ['مبعث حضرت رسول اکرم صلی‌اللّه علیه و آله (۱۳ سال قبل از هجرت)'];
    lunarHolidays[8][15] = ['ولادت حضرت قائم عجل الله تعالی فرجه (255 هـ ق)'];
    lunarHolidays[9][21] = ['شهادت حضرت علی علیه السلام (40 هـ ق)'];
    lunarHolidays[10][1] = ['عید سعید فطر'];
    lunarHolidays[10][2] = ['تعطیل به مناسبت عید سعید فطر'];
    lunarHolidays[10][25] = ['شهادت حضرت امام جعفر صادق علیه‌السلام (۱۴۸ ه‍.ق)'];
    lunarHolidays[12][10] = ['عید سعید قربان'];
    lunarHolidays[12][18] = ['عید سعید غدیر خم (۱۰ ه‍.ق)'];

    return lunarHolidays;
}